[
  {
    "name": "April Colbert",
    "rating": 1,
    "date": "2025-07-03",
    "content": "So unprofessional, truly. I would not do business with this company if they were the last fencing company in Florida. I called for a very simple fence repair for a PVC fence (I literally need two posts and enough arms to put the fence back up). I was told, without Danielle Fence sending anyone to look at my fence OR without asking for pictures, that Danielle Fence simply cannot do the job. They don't carry the fencing. I asked how they know without seeing what my standard suburban PVC fence looks like and the guy said they just won't have it. They essentially carry elite materials that are so unique and the measurements are special that other vendor materials simply cannot compete and are less than Danielle Fence materials. Once more I asked how he has this wisdom to know this is the case (I live in a cookie cutter neighborhood) and he said to send a picture. So, I guess the guy has magic abilities to measure from a picture and tell clients to pound sand if the original fence wasn't from Danielle Fence. I'll go with a local mom & pop fencing company can magically find the right fencing to use. In fact, my second call got it done! People, give your money to a company that isn't high and mighty and that cares about their communities of interest. Danielle Fence, might want to fire that guy. He referenced 60,000 calls post Milton and said Danielle Fence simply doesn't carry those subpar materials. Imagine the revenue your company is missing. But, hey, that guy is the face and voice of your company. Jeff Friedrich 9 reviews • 3 photos Outstanding Work—My Go-To Fence Company! I’ve used this company multiple times now, and they continue to exceed expectations. Most recently, they installed a 6’ vinyl privacy fence in my backyard and a 48” aluminum fence across the front—and the results are flawless. From to finish, the team was professional, detail-oriented, and right on schedule. They communicated clearly throughout the process, showed up when they said they would, and left the job site clean and tidy. The craftsmanship is top-notch, and it’s clear they take pride in their work. It’s rare these days to find contractors who deliver on all fronts—quality, timeliness, and professionalism—but this team does just that. I won’t use anyone else for fencing work and confidently recommend them to anyone looking for high-quality installation with zero hassle. A+ experience every time. ⭐️⭐️⭐️⭐️⭐️"
  },
  {
    "name": "Ron",
    "rating": 5,
    "date": null,
    "content": "Great service and excellent workmanship. Fence looks great. Would highly recommend this company."
  },
  {
    "name": "GREG",
    "rating": 5,
    "date": null,
    "content": "From the salesman to Sue in the office and installers all professional. Would definitely recommend them to friends and family."
  },
  {
    "name": "Ali",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence was easy to work with and did exactly what I wanted. They have wonderful customer service and the crew that came to do our fence hustled and got my old one down and new one up in less than a day. I love it and would recommend them to anyone!"
  },
  {
    "name": "Rachael",
    "rating": 5,
    "date": null,
    "content": "Excellent company. They did an amazing job. Fence looks great. Quick response to questions. Would definitely recommend them!"
  },
  {
    "name": "David",
    "rating": 5,
    "date": null,
    "content": "Our community has had a long and happy experience with Danielle Fence. Over time we have been replacing wood with vinyl. The field crewmen are conscientious, and they take pride in their work. I recommend Danielle wholeheartedly."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-24",
    "content": "I went with Danielle Fence Co. nearly 30 yrs ago when I bought my newly constructed home!! The front Hollingsworth lattice style has withstood the test of Time!! The wood shadow-box, I just replaced with their Lakeland industrial vinyl!! I Could have gone with a less expensive and less waiting time Install....BUT....You Get What You Pay For!! There's a reason Everyone WAITED the 4+ month after the Hurricanes to have Danielle Fence Co do their Installs!! Choose Wisely!!"
  },
  {
    "name": "Bart",
    "rating": 5,
    "date": null,
    "content": "Great job! Completely satisfied with the crew, the work they did and the quality of the product. Would highly recommend Danielle Fence & Outdoor Living to everyone. Thank you!"
  },
  {
    "name": "steve",
    "rating": 5,
    "date": null,
    "content": "The crew arrived as scheduled and were professional and did a great job!"
  },
  {
    "name": "Jeanette",
    "rating": 5,
    "date": null,
    "content": ""
  },
  {
    "name": "Matthew",
    "rating": 1,
    "date": null,
    "content": "Danielle Fence did an amazing job removing our damaged fence (thank you hurricane Milton!) and installing our new fence. I recommend contacting them for your fencing needs! Big shout out to Darrell and his team! Darrell was a pleasure to communicate and work with during the installation process."
  },
  {
    "name": "Kimberly",
    "rating": 5,
    "date": null,
    "content": "They did a great job. They were professional and the gate looks good and strong."
  },
  {
    "name": "Hippie",
    "rating": 5,
    "date": null,
    "content": "Top notch service and staff with great attention to detail. We couldn't be happier with our experience and will definitely recommend Daniel Fence to anyone looking for quality and friendly service."
  },
  {
    "name": "Billy",
    "rating": 5,
    "date": null,
    "content": ""
  },
  {
    "name": "Amit",
    "rating": 1,
    "date": null,
    "content": ""
  },
  {
    "name": "Bruce",
    "rating": 1,
    "date": null,
    "content": "We are extremely happy with our New PVC fence! It looks amazing! Your installers did an outstanding job installing it. Very courteous, friendly and kept checking with me during the installation as well. They even hauled off some extra plywood and an extra gate that I asked them to do. They went above and beyond what we expected! We love it and will recommend you to all our customers, friends and coworkers. Thanks for the quick and professional service!"
  },
  {
    "name": "Jordan",
    "rating": 5,
    "date": null,
    "content": "Bad communication, did not explain much and fence I didn’t want was installed. Too bad for me"
  },
  {
    "name": "We",
    "rating": 5,
    "date": null,
    "content": "Professional and did what they said they would do."
  },
  {
    "name": "Markus",
    "rating": 5,
    "date": null,
    "content": "Thank you Mark and crew for an outstanding job installing my fence. Job well done!!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": null,
    "content": ""
  },
  {
    "name": "Randy",
    "rating": 1,
    "date": null,
    "content": "Danielle Fence has been outstanding to work with and my dogs are most appreciative of their new fenced in back yard!"
  },
  {
    "name": "Spacey",
    "rating": 1,
    "date": "2025-02-27",
    "content": "I spent over $6000.00 to have this company install PVC privacy fencing on my property and they are going to charge me 100.00 to come out and give me an estimate to fix my fence. WOW!! I see how much they care about returning customers. There are so many more fence companies out there. I think I will take all my future fencing needs elsewhere. WOW how disappointing the service is!!!! Greed bites back just like karma!! Evelyn Walling Local Guide • 30 reviews • 8 photos Fence is too high off the ground unlike my neighbors! Way too much space! If not for that , it would definitely be a 5 review! I’m real big on customer service and their customer service was excellent! David Dier Local Guide • 65 reviews • 207 photos Customer service was great. We're very helpful, friendly and prompt"
  },
  {
    "name": "Chris",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence came out and repaired our fence after Hurricane Milton. They did a thorough review of all of the hardware, came out quickly, and did a quality job! I appreciate the care they showed."
  },
  {
    "name": "Larissa",
    "rating": 5,
    "date": "2025-02-06",
    "content": "Contratamos a Danielle Fence para instalar la verja en el perímetro de nuestra propiedad. Estamos muy contentos con el trabajo realizado. Desde la cotización inicial hasta la instalación final siempre tuve comunicación clara y detallada sobre el proyecto. El día de la instalación el equipo de trabajo llegó muy puntual. Los trabajadores fueron cordiales, limpios, y muy profesionales. linda lawless Local Guide • 382 reviews • 365 photos Danielle Fence is professional with a fantastic staff and high quality products. Kim is a pleasure to work with and guided me through the process from beginning to end. Everyone I have met at Danielle Fence is outstanding!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": null,
    "content": "I had a great experience working with Danielle fence, their appointments were timely and the follow up was always has a quick turnaround. They walk you through all the processes and answered any questions that I had. The day they came out it was quick and seamless."
  },
  {
    "name": "We",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence installed my fence and it’s been fantastic - it’s survived 3 hurricanes with minimal work needed to repair! Not only that, but the employees on site are always super helpful and go out of their way to take care of their customers! I’m already planning my next big project (outdoor pavilion area) and I’m 100% coming back to them for that project too!"
  },
  {
    "name": "Sue",
    "rating": 5,
    "date": null,
    "content": "The 3-man team worked diligently in a steady drizzle replacing pvc posts, upper and lower rails, and fence slats, as well as straightening out 376' of fencing that was blown out of alignment from Hurricane Milton. Very pleased with work performed."
  },
  {
    "name": "Muriel",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence installed my fence! They were fast, efficient, always courteous, did a WONDERFUL job. After hurricane Milton, a corner of my fence was destroyed. I called, they came. Same as above! Absolutely no complaints, completely happy. Would use again!!!"
  },
  {
    "name": "sharon",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence is a great company. Everything explained very clearly to us, dates of arrival and project completed on time and supervisor present and overseeing every minute to insure job was done correctly. Thank you for a great job."
  },
  {
    "name": "Deana",
    "rating": 5,
    "date": null,
    "content": "We are so happy with our Danielle fence! From the moment we met Andre to our interaction with the office staff and Michelle to the day of install was amazing! Best investment I’ve made so far on our new home! The install date was moved up almost by 2-3 weeks and also the crew on the day of install was so nice and efficient and very punctual and showed up right on time! Danielle fence went above and beyond our expectations we are so happy and our dogs are living their best life! We didn’t realize how much this fence would impact our family and we are so happy! They didn’t not miss one detail! We felt very taken care of and important to their company the whole experience! Multiple companies should adopt their business structure -they do it right!!! Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Vinyl fence installation"
  },
  {
    "name": "Debbie",
    "rating": 5,
    "date": null,
    "content": "Danielle Fence did a great job leveling my existing 6’ vinyl fence after Hurricane Milton came through Bartow and unleveled it. They, the workers were very professional and did excellent work. Debbie, Bartow, Fl."
  },
  {
    "name": "If",
    "rating": 5,
    "date": "2024-10-31",
    "content": "Danielle Fencing placed my fence in 2009, after hurricane Milton blew out 10 of my panels ( that I was able to find) they are charging a $100 price for a quote and charging $795 to to reinstall my 10 panels. That is a ungodly price for such a very small service. I am disabled and cannot do the very small job myself. I am one very disappointed customer. I would never do repeat business with them again. Just WOW. 😳😲😯😤😤 Ben Darby & Mark Stewart Local Guide • 146 reviews • 469 photos They had the part I needed for our Danielle fence. Quick and easy, folks are super nice. They have a nice, big display area outside, also showing patios, gazebos, fencing and back yard ideas."
  },
  {
    "name": "It’s",
    "rating": 5,
    "date": "2024-10-31",
    "content": "I have called 5 times over the last month to just schedule getting a quote for a new fence. Per Danielle Fence's process, I am supposed to be getting a call back from a technician regarding scheduling and availability, this hasn't happened and I have followed up once per week for 4 weeks now. I guess they don't want my business. Would not recommend this company. Justin Ricke Local Guide • 54 reviews • 9 photos They have done two fences for me. Fast, efficient, and quality product."
  },
  {
    "name": "Pennye",
    "rating": 5,
    "date": null,
    "content": "We had fence damage from hurricane Milton. Thom came by and was able to slide the fence pieces back in! We have had our fence since 2020. We love our fence . Very sturdy and dependable! Thom was great!! Thank you so much!!"
  },
  {
    "name": "Michael",
    "rating": 2,
    "date": "2020-08-07",
    "content": "Decent product gets 2 . At the time I bought the fence 3. it was a 8 week wait for installation. During installation I told the head guy to be careful of the buried French drain. Paid close to 9K back in 2021 for this job. Fast forward 2.5 years later a hole to open up under a fence post. When contacted for a repair they told me it wasn't covered under a warranty and it \"looked like a sink hole\", then quoted me 850$ for a repair. I ended up doing it myself for 35$ worth of quikcrete and a little sweat. During my repair I discovered the cause of the issue is that they broke open the French drain and the cloth covering around it so they caused this erosion or \"sink hole\". Ok product like any other vinyl fence, but awful customer service, once they got your money they don't care about you. Update after response: it's extremely likely the installers cracked the French drain, there was never any digging in that area, no trees, fences, anything. At this point it doesn't matter, I fixed what these \"professionals\" couldn't."
  },
  {
    "name": "We",
    "rating": 5,
    "date": null,
    "content": ""
  },
  {
    "name": "Kevin",
    "rating": 5,
    "date": null,
    "content": ""
  },
  {
    "name": "Please",
    "rating": 1,
    "date": null,
    "content": "We recently had the pleasure of working with Danielle Fence, and from to finish, they exceeded our expectations in every way. The entire crew was highly professional, and their commitment to delivering top-class customer service was evident throughout the entire process. From the first consultation to the completion of the fence, everything was handled smoothly and efficiently. The finished fence looks absolutely wonderful, and we couldn’t be more pleased with the result. We would definitely recommend Danielle Fence to anyone in need of their services, and we will happily work with them again in the future. Thank you for a job well done!"
  },
  {
    "name": "Whitney",
    "rating": 1,
    "date": null,
    "content": "I was referred to them by my parents who have used them twice. They provide excellent service from to finish. Great quality work, too! They listened to what I wanted and accommodated my requests. The fence looks great and is sturdy. Highly recommend them!"
  },
  {
    "name": "Raymond",
    "rating": 5,
    "date": null,
    "content": "installation crew were timely, professional."
  },
  {
    "name": "Pat",
    "rating": 5,
    "date": null,
    "content": "We enjoyed working with Danielle Fence! Thom Simon in Sales was polite and professional, and provided a quote for exactly what was needed. Our HOA process is quite grueling, and Sue Helms provided everything we needed so our application was approved quickly. The install team arrived on time and finished the same day. They cleaned up our yard before leaving. We love our new fence and gates! UPDATE: we had an inground pool built in our backyard. This required removing 13 sections of the fence for the equipment to access the backyard. Danielle sent a crew that carefully removed the fence sections and then wrapped and stacked the sections in our garage for us. Last week they sent two crew members to reinstall the fence for us. Hardworking, considerate and conscientious gentlemen. I highly recommend Danielle Fence!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-02-16",
    "content": "Service was great from quoting, permitting, & installation."
  },
  {
    "name": "Rhonda",
    "rating": 1,
    "date": null,
    "content": "Danielle Fence put my fence up approximately 3 yrs ago. With HOA they were familiar with all the rules. It has been great. Wonderful customer service. I called today to see if someone could come out and look at my gate to see if it could be adjusted. My dog is getting out right where the door locks. I was told by Sales that they would pull my survey on file & look if any adjustments could be made. I was surprise to get a voicemail saying that “ by looking at the survey , NO adjustments could be made.. 🙄 I honestly did not realize a survey could give that sort of information.."
  },
  {
    "name": "Gerard",
    "rating": 1,
    "date": null,
    "content": "We recently had the pleasure of working with Danielle Fence & Outdoor Living to install a new fence, and the experience was nothing short of exceptional. From to finish, their team displayed professionalism, dedication, and outstanding customer service. A special thank you goes to Thom Simon, who ensured every detail of the project was handled with care and precision. Mark & Crew were fantastic, working diligently and efficiently to install the fence to perfection. Gavino and Hector as well for coming back out and quickly making the adjustments we requested and for their hard work and attention to detail. Their combined efforts have truly transformed our outdoor space. The quality of workmanship and the professionalism of the Danielle Fence team exceeded our expectations. We couldn't be happier with the final result, and we highly recommend Danielle Fence & Outdoor Living to anyone looking for top-notch service and exceptional results. Thank you once again to the entire Danielle Fence team for an amazing job and for making this experience so positive. Sincerely, Tim G. Jones"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-07-31",
    "content": "Danielle Fence installation team did an awesome job setting up our new fence completing it in 6 hours. Highly recommend."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-07-22",
    "content": "Fence looks great. Danielle Fence was easy to work with. They also did our outdoor kitchen and we love it!!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-07-03",
    "content": "Really recommend these folks. Super professional and knoledgeable. no nonsence, great price, fast service. they give you a very proffesional drawing of what your going to receive. Wish they were in more counties! Thanks"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-06-25",
    "content": "Danielle Fence did a great job with my fence installation! They came early, worked really hard and got the job done! If you are on the market for a new fence, contact Danielle Fence!! I highly recommend them! 10 out of 10!!"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-06-17",
    "content": "Danielle Fence was very professional in all aspects of the process..From to finish, I couldn't have been happier..If your looking for a quality company who stills values Customer Service as a component to their Business Model, look know further and contact Danielle Fence and ask to speak to Richard..Thank You Sir or a Smooth and Easy Experience.."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-06-12",
    "content": "Quality work finished on time"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-06-12",
    "content": "We were extremely happy with the service provided by Danielle Fence & Outdoor Living. They were very meticulous, both in planning and execution of our fence project. We appreciated that we did not have to deal with sub-contractors and had one point of contact for the job. The results exceeded expectations. The installation crew was professional and hard working. They completed our job in one day and were responsive to do minor adjustments after the installation. We would highly recommend Danielle Fence to anyone looking for a quality fence. Without a doubt, a 5 company."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-06-12",
    "content": "They have a lot of nice fencing selections. You are sure to find what you were looking for and the sales person is very knowledgeable of their products and is very pleasant to do business with so why don’t you head on down to Danielle fence and outdoor living and see what your next adventure will be? I know what’s going to be lovely so what are you waiting for? Have that car warmed up at 8 AM in the morning and head on to Danielle fence and outdoor living and shopping oh yeah.😁 and when you’re there, be sure to look and see if you can spot any of the orange and green lizards😎"
  },
  {
    "name": "Jun 12, 2024",
    "rating": 5,
    "date": "2024-05-15",
    "content": "This company installed a fence around my neighbor's property last Monday. In the process, they trespassed on our property throughout the entire day. They used our property to access the neighbor's--including literally tearing down a vine that I had intentionally let grow from a trellis on our property to a tree on our property--without permission and after being told repeatedly to stay out of my easily accessible side yard that was not there for their convenience. They wandered around on our property to install the fence, probably because our ground is flat and cleared, while the neighbor's is an uneven drift of brush piled up against the old, dilapidated fence. They left--UNDER the new fence and protruding into our yard--the literal TRASH and mess of vegetation that had been mounded against the sagging, old fencing. They dumped dirt on top of our clean pine straw. They never asked permission to be on our property. They damaged our landscaped space. They never returned repeated phone calls to discuss their actions. So, if you want to abuse and usurp on your community, this is definitely the company for you--otherwise, I would encourage you to look elsewhere. Melanie Cooksey 9 reviews • 0 photos Great experience with Danielle Fence from the first gentleman who came out, Thom, to Sue who I worked with regarding scheduling and permits. The foreman and crew were amazing! Got to my home at 7:30 am and were completely done before 4:30! That was to remove chain link fence all around and replacing with the new fence. WOW! I love my new fence - thank you!!"
  },
  {
    "name": "May 21, 2024",
    "rating": 5,
    "date": "2024-05-06",
    "content": "BEAWARE! I had Danielle install a large fence around our back yard many years ago and they did an awesome job; however, if you run into small issues like a section of the fence becoming out of alignment, guess what! THEY DON'T WANT ANY SMALL JOBS...QUOTED ME $1700.00 to be repaired and to alter how it would look so you could only respond \"No\" to their solutions. To me this put a very negative feeling in my gut and to find out after contacting AJ Fence my repairs only cost me $435.00 and it looks brand new. Danielle Fencing will ONLY WILL DO LARGE JOBS other than that don't work with them PERIOD....Dean Stavely Garrett Hill 2 reviews • 0 photos"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-05-21",
    "content": "muy buen servicio y precio el customer service es increible , me ayudaron con los permisos y el hoa, siempre estan pendiente de que el customer este contento y son muy profesionales los recomiendo 100%"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-05-02",
    "content": "They were great! Very quick and efficient! Thank you!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-05-02",
    "content": "Excellent crew, they showed up on schedule. I was able to get an install date immediately."
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-05-02",
    "content": "Danielle Fence is an Amazing company. From the very when we visited their showroom till the completion of our fence. They were knowledgeable, friendly and very helpful. The employees we'd like to give a special thank you to are Rhonda, Tom and Mark and his crew. They all did a fabulous job. We would definitely recommend Danielle Fence Company."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-04-10",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-04-08",
    "content": "Great process from to finish. The entire team was fantastic!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-29",
    "content": "Danielle Fence did an amazing job with our white vinyl fence! Thom was very easy to communicate with when we were getting our quote, and really took the time to explain all the ins and outs to us. The lead time was unbeatable as well. They originally told us 4-8 weeks, but they were able to get us on the schedule in 2! Everyone was very friendly and helpful, and the crew that came to install the fence was phenomenal. They arrived right on time at 7:30 am, and despite a few unexpected delays, which were handled quickly and efficiently, they were finished with the whole thing by 3:00 the same day. I would absolutely recommend this company to anyone in the area needing a fence, and would definitely hire them again!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-26",
    "content": "Danielle fence is very reliable and friendly. From the beginning to end, they were very professional and courteous. Explain everything to complete the job. The supervisor (Mark) and the entire team awesome. I actually recommend them to my neighbors as well. Thank you., Danielle Fence."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-25",
    "content": "They were very professional and clean. After our fence was installed they were careful to hose everything down so it looked bright and clean. Edwin, Oleyario and Marice were courteous polite and efficient. I highly recommend Danielle Fence."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-20",
    "content": "Very happy with our wood fence installed by Danielle. Thom was knowledgeable and helped us pick what worked best for our needs. The install team were efficient, experts at their craft and friendly. Our fence was done ahead of schedule and we were kept well informed of all the steps along the way. Highly recommend Danielle fence."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-14",
    "content": "What can we say about Danielle Fence except that they’re absolutely AMAZING! Starting with Kevin, Rhonda, Sue, Lisa, the job foreman, the guys doing the actual install, this entire team are the real deal. The level of kindness, professIonalism, hard work, level of detail more than surpassed our expectations! This was the first time we actually had to go through the HOA process and Sue made it so seamless! Sue worked proactively in getting all the paperwork needed for the HOA approval ready even before I submitted to the HOA. The turnaround time for the HOA is typically 45 days and with Sue’s help, it literally was ALL completed in under a month. THANK YOU ALL for making the entire process for us so painless!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-05",
    "content": "The whole process was a pleasant experience, and the finished product is beautiful. Everyone that I spoke too or dealt with was very professional and polite."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-05",
    "content": "We are very pleased with our new fence! The team at Danielle Fence is a pleasure to work with. Everyone is professional and knowledgeable and we look forward to working with them again!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-05",
    "content": "Great work! Love my new vinyl fencing!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-03-05",
    "content": "Get company. Kept me informed of schedule and came on time. Installers did a great job. Satisfied customer"
  },
  {
    "name": "Mar 4, 2024",
    "rating": 5,
    "date": "2024-02-14",
    "content": "Fred Koehler 15 reviews • 0 photos Danielle Fence went above and beyond when, due to my mistake, the fence was a little too close to the house. They got us sorted with a smile and still thanked us for our business even though they had to do extra work. Highly recommended."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-02-16",
    "content": "On Time Very Well Installed. Install Crew was very neat and Professional Office is fast to respond with questions or concerns"
  },
  {
    "name": "Feb 16, 2024",
    "rating": 5,
    "date": "2024-01-31",
    "content": "After the fence was installed I noticed It’s not on the property line on one side of the property & the gate on the opposite side has 10 inch gap under the gate & corner. Called to voice my concerns, weeks later a “representative” from Danielle Fence comes out & tells me the fence is definitely not on the property line & the gap under the opposite side is acceptable to Danielle Fence. As the property owner, I’m looking for only 2 things in a fence. 1..The fence be directly on the property line 2. The fence have no gaps or space underneath. Epic fail on both expectations. Now I’ve called again several times to have someone from Danielle explain this to me with no return phone calls. ZERO STARS!!!!!!!!!!!!!! Taylor Giese 8 reviews • 1 photo Amazing experience. They helped me with the HOA approval and got my fence installed in a timely manner. The fence looks incredible. They always answered when I called or emailed. Will be referring them!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-02-02",
    "content": "Great product and great installation of our fence at First Baptist Church of Bartow."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-31",
    "content": "Honestly this company is great but they have incompetent technicians who come out and to give a wrong measurement and then blame it on you, hence making you to pay additional charges. I regret using them to install my fence. There are other companies that charge less with the same quality. I will never introduce anyone or family member to this company as they are only about what they get from you and not about their customer. My fence is still not closed since the half baked install; uncompleted work. I will have to raise $900+ to complete their payment. One of the owners arrogantly said that there is nothing they can do to meet me halfway to settle the miscommunication between the me and the technician. I have to raise that money to pay them off. Greg who is one of their managers is awesome with a great customer service skill. Because of Greg I will refer others to them. Thanks"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2024-02-16",
    "content": "We love our Outdoor Kitchen from Danielle! From to finish everyone was great to deal with. The finished product was beyond our expectations. Our new Outdoor Kitchen ties in perfect to our lanai and has given us a beautiful gathering spot for friends and family. Thank you Danielle Fence!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-26",
    "content": "I have known Paul one of the owners since 1998 He was on one of my Federal Express/ UPS routes over the years and I have been using his services since I recommend you contact them for any Fencing or outdoor service 🙏🇺🇸❤️"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-26",
    "content": "Always our place to turn to when we need fencing. Have been a customer since 2005"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-21",
    "content": "Danielle Fence does great work! All the people are helpful and respectful. They are detail-oriented and tailor the job to the customer. If you're looking for quality workmanship, hire Danielle Fence."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-26",
    "content": "Great company to work with! Everyone from salesperson to installers very pleasant to work with. Any questions or concerns were addressed quickly. Installation was seamless and our yard was left perfect and totally cleared of any materials, debris and trash. Our pups love having their own space to run and play."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-26",
    "content": "Once again Danielle Fence company has proven themselves to be the best company. The workers were experienced and knowledgeable of the job and worked together to install my fence and gates.I don't know who was the happiest, me or them! Danielle Fence uses quality materials that stand up to our Florida weather as well as ages (wooden fence) beautifully. I am a repeat customer and proud to be one! You can rely on this company every time. Thank you Danielle Fence!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2024-01-17",
    "content": "The completed installation was nicely done. There was a property line issue with a neighbor's fence. The office staff worked to resolve it so the installation could be completed on time. I appreciated this! Positive Responsiveness, Professionalism Services Fence design, Fence installation, Installation, Privacy fence installation, Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-09-19",
    "content": "Very expensive"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-11-08",
    "content": "Several request for an estimate, no response."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-09-13",
    "content": "Why are you making it sooo difficult to buy a fence these days? Used to be a pleasure to do business and now it is all “protocol” and no service. I miss the old Danielle fence. I just want to give you money and get work done. $15k reasons to keep looking. Follow up. The work got done. The crew was great. Management asked for payment before the gates were delivered. They Offered to take a grand off (gate up charge was more than that). Paid them early.. too much hassle to fuss with. I ended up rebuilding one gate from scratch because it wasn’t what my wife wanted and it was just easier than asking them. Never saw my salesman again. Expected him to visit to check clearance of shrubs from fence… nope. So go with lowest bidder."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-05-15",
    "content": "The crew was so amazing, they did a fantastic job and so nice. I would highly recommend them. I posted this for my dad (R. Mccann) Positive Professionalism"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-08-01",
    "content": "I had a very good experience with Danielle Fence. From the beginning to the end it was extremely professional and great communication. Sue took care of pretty much everything from the beginning with the paperwork required and permit we needed, and Lisa in scheduling was great as well! The install crew was on time the day of service and told me exactly what they were going to do and how long it would take. The gate had to be custom made and the crew leader said it may be up to two days more for that to come and be put in, but it didn’t take that long. They were able to get it put in that same afternoon! Also, when I needed some dirt put back in where the posts were installed, the crew came out the next day to fix the issue. I would definitely recommend this business to anyone needing a fence installed! Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-06-19",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 2,
    "date": "2023-05-12",
    "content": "In April 2023 I worked with Rhonda to select and purchase some vinyl fencing for a small DIY project. Rhonda was extremally helpful. She answered all my questions and showed me the different fence styles in their display areas. She never made me feel like my small sale was a waste of her time. When picking up the items I needed, the yard crew was also very friendly and got my fencing materials loaded on to my trailer quickly. Dale Austin Positive Responsiveness, Punctuality, Quality, Professionalism Services Service not listed"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-04-25",
    "content": "Had exactly what I needed after one of my guys dropped a log and broke homeowners fence"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2023-04-03",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-21",
    "content": "Hurricane Ian damaged about 80-fet of my aluminum fencing. Called Danielle Fencing for help. They made sure I got an exact match to what I had already. The crew arrived on-time and did the work rapidly. Outstanding effort, and I got better than I hoped for. I wouldn't even consider using anyone else in the future. Positive Responsiveness, Quality, Professionalism Services Aluminum fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-21",
    "content": "Built really well."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "Great assistance from Tom. Great installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "The first problem is no warranty and not a good explanation of their product especially the MPH rating. The quality of the fence is not good. After hurricane Ian if you noticed a fence down mostly likely it was a Danielle Fence, based on the signs on them. They mostly install the outside fencing for residential communities. My fence that was installed last year at my home is not longer in a straight line, it is swaging. Also the top vertical bars are held together with screws and bolts but they fail to mention this as far as materials used. The fence that I saw hold up to a hurricane was Fence Central and Cambridge. A good company is one that stands by there product. Danielle Fence told me it is not covered by hurricanes. know I'm curious to know how much they are gonna tell me this will be. I will be back on to give you all the update on my appointment with them. And I will be happy to change this rating if this issue is rectified. Danielle Fence came out on 12/13/2022 and they told us that they would give us a quote on what needed to be done and and as of to date 1/8/2023, they have not reached back out to us."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "They are the ones who originally installed our fence. We will not use them ever again nor will we recommend them to anyone. We requested they fix our fence which had minimal damage compared to others (back leaning in from wind, bottom rail slightly bowed but sections intact, only one small panel out) after a hurricane. They charged $964 to stick boards under fence to raise panels and then pounded in posts (never took any part of the fence apart or replaced anything except one post top). The one small panel that had popped out they just kept banging on it until it popped into place - never removed the top rail. They didn’t even bring dirt to backfill. Then I specifically told them the bottom of fence had to be off the ground for drainage. My husband called that afternoon because at least 3 - 4 panel sections were sitting on the ground and requested they come out to raise them and make all posts even to height of corner posts. They came out a couple weeks later but only raised the right corner posts and workers said intake caller only did work order for raising the corner post up not raising back fence panel sections. My husband called the office and left message while workers were there. No phone call for two weeks until I called and inquired about voicemail. Then husband gets a call saying we would have to pay more money if they came out again. My recommendation would be to save your pocketbook and go with a company that cares about their customer’s satisfaction with their work product. Negative Responsiveness, Professionalism Services General repairs & maintenance +2"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-08-15",
    "content": "Ask for Luis to build your fence. I explained that I did not want the dogs to be able to even see under the fence. They worked so hard to do that. It was not easy, but they did it. Positive Quality Services Privacy fence installation"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2023-03-21",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-21",
    "content": "Good company. Mathias and crew were professional and respectful. Positive Quality Services Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2023-03-22",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "This business is great. I had some fence damage due to hurricane Ian and needed a post fory gate. I went to two other businesses with no luck. I was directed to Daniel Fence & Outdoor Living. The receptionist was very friendly and the gentleman that helped me (Rob, I believe) was extremely knowledgeable. They had my order drilled and ready in less than three days. If you need it done and need it done right ( the post fit perfectly) go to this location."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "I recommend Danielle Fence & Outdoor Living to my friends and family because they did a excellent job on the installation of my Fence."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "Great company"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2023-03-22",
    "content": "Didn't return my calls and when I called them again the person was very rude. I think they only want to deal with big corporations."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-07-19",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-07-18",
    "content": "Had the Adobe commercial grade fence installed. Beautiful fence,high quality, best sturdiness of any pvc fence I have ever seen. Crew was on time,professional, did a tremendous job. When they left the entire area was spotless. They even took the time to wipe the entire fence down to remove any sand and loose grass. I highly recommend this company. Positive Responsiveness, Punctuality, Quality, Professionalism Services Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-07-18",
    "content": "They did a great job! Very professional and up front about the entire process. The installers were hard working and obviously care about doing their job well. Positive Punctuality, Quality, Professionalism Services Privacy fence installation, Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-07-15",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-07-11",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-28",
    "content": "This company installed the fence at the house we purchased a few years age. Their sign was on the fence. We needed a 4’ gate installed out the back. So I called them for a quote. $4,900 was the quote they gave me. I wrote them back telling them they could have just told us they were too busy, and recommended someone else. That quote was insulting. Skip these folks. We called a local fence company and got the gate installed for $425. Negative Responsiveness, Professionalism, Value"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-17",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-09",
    "content": "Horrible. They give you an estimate and say that it can change to be more expensive.."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-09",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-08",
    "content": "Had an appointment to meet at my house and get a quote for a fence and a patio, which I had to leave work an hour early to make. They didn't show or call. Negative Responsiveness, Punctuality, Professionalism"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": "We contracted for our new fence back in Nov 2021 and Danielle fence installed our new fence on 4/20/22. But the wait was worth it! They came all the way up to Spring Hill Fl to install our new fence for our New Custom Home. Callie our German Shepherd couldn't be happier! She hates a leash and now can run like the wind around back yard! They did it in one day! Amazing, and the Forman was very focused on customer satisfaction! We highly recommend Danielle Fence! Thank you!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": "Excellent.Very proffetional and helpful. Very clean and neat work."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-07",
    "content": "Great fence!"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-07",
    "content": "I cannot expression the great experience i had with Danielle fence from the time someone came to give me the estimate to the day of installation the crew came on time and got to work was always in contact with me if there was an issue, very good company and i am definitely going to refer them to anyone who ask me Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-02-08",
    "content": "The whole process was seemless , professional and installation was outstanding. The crew arrived on time. Kudos to the whole team. I plan on utilizing this company again.... highly recommend! Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Installation, Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": "This place has tons of fence supplies in stock! Def recommended."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-01-20",
    "content": "They have excellent customer service and quality materials."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-01-20",
    "content": "I can not say enough good things about this company. When I couldn't get anyone else to come put up my 8ft vinyl privacy fence Danielle Fence was the only one to come through. On time, professional and I love my fence!!! I will always use them and refer them to others. Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Installation, Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-01-20",
    "content": "From to finish it was a great experience. From David my sales guy, to the ladies in the office and my FABULOUS installer Mark and his crew. I can't thank you enough!!! Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Vinyl fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-01-20",
    "content": "Whether it's by phone or you just show up they're extremely polite and helpful."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": "Over priced if you don't let them put it in ,"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-07",
    "content": "Great customer service"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-07",
    "content": "From to finish I could not be happier. They took care of everything Hoa approval etc. installation crew was 100% on the money I highly recommend them Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Installation, Iron fence installation"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2022-06-07",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2022-06-28",
    "content": "Sales guy was great. Installers, not so much. Negative Professionalism Services Installation, Vinyl fence installation"
  },
  {
    "name": "Jul 15, 2022",
    "rating": 5,
    "date": "2021-08-08",
    "content": "I am so pleased with our new vinyl fencing. Luis and his crew were on time, professional, and extremely knowledgeable. I asked for the fence to hug the ground to block cane toads and prevent my little dog from escaping and they did an awesome job. Thank you! Positive Responsiveness, Punctuality, Quality, Professionalism, Value Services Vinyl fence installation Lanie Local Guide • 15 reviews • 0 photos Danielle fence provided us with a beautiful product and staff were incredibly knowledgeable. They helped us navigate a difficult HOA approval process and executed perfectly. Positive Responsiveness, Punctuality, Quality, Professionalism Services Vinyl fence installation Joe Conklin Local Guide • 15 reviews • 47 photos Steve S Local Guide • 221 reviews • 0 photos Very personable salesman but prices were significantly more than any other we got. Bailey Browning 3 reviews • 0 photos Patricia Whitehurst Local Guide • 31 reviews • 38 photos Vicky Farless 10 reviews • 0 photos Marco Cajina 14 reviews • 1 photo Going to contact them later melvin Santamaria 2 reviews • 1 photo Miguel Vilches 1 review • 0 photos Worst people to deal with, we called few times and the response for personnel (Daniel Grantham) very unprofessional make you feel like you are bother them and wasting their time. Negative Quality, Professionalism, Value Services Vinyl fence installation Familia Lopez-Morales Local Guide • 40 reviews • 1 photo Gwen Conner Local Guide • 245 reviews • 12 photos I called them with questions. The gentleman was very friendly and informative. francisco ponce Local Guide • 16 reviews • 27 photos Lina R. Local Guide • 70 reviews • 303 photos They are pretty good answering fast and providing the info you need. We scheduled our installation for April Aaron Frazier Local Guide • 50 reviews • 230 photos Great products but they are extremely busy this time of year. If you have a project do not wait. Kevin Simpson 11 reviews • 0 photos Gary Sweers Local Guide • 127 reviews • 1 photo John Dyer Local Guide • 20 reviews • 1 photo Adolfo Cordeiro Local Guide • 35 reviews • 0 photos I never got to see them in action, a few days before the estimate appointment, they emailed to let me know the person coming to my house got sick and the appointment had to be postponed. For a company that has put fences all over polk county, they should have more employees to fulfill their appointments. I canceled and went else where for a fence. Yuniesby Perez 2 reviews • 0 photos El peor lugar q e vivido más d una semana sin luz pq no resolvían el problema y yo pagaba mi renta por una aplicación d ellos y el día q me fui a ir me salen q debía dos meces de agua cuando eso se le pagaba a ellos y después no sabían de ese dinero"
  },
  {
    "name": "Mar 15, 2021",
    "rating": 1,
    "date": "2021-01-18",
    "content": "Beautiful material, quite pricey these days Elaine Pearce Local Guide • 36 reviews • 27 photos I am in the market for some fencing. Called this company and was transferred to an unskilled \"order\" taker. No selling from this person, no guidance Horrible experience. This company is losing opportunities. The experience was so poor I wouldn't consider doing business with the company. Negative Responsiveness, Professionalism Jibraan M Local Guide • 30 reviews • 32 photos Joe Burket Local Guide • 220 reviews • 0 photos Really nice facility had all the samples we want to look at for fencing very knowledgeable staff very helpful Jose Cruz 4 reviews • 0 photos Chriss Morriss 4 reviews • 0 photos Greg Walker Local Guide • 37 reviews • 0 photos Larry Zucker Local Guide • 253 reviews • 3 photos Everyone I've talked to was so nice, there coming out Tuesday 11/10/20 to give us an estimate . Laurel Waddingham Local Guide • 19 reviews • 0 photos Great customer service. Richard went above and beyond to help us with our fence. Wouldn't go anywhere but DANIELLE! 💯 Rachel Lombardo Local Guide • 160 reviews • 2755 photos Zero really. No show. No call. Had an appointment set all week for 4pm yesterday and they never gave me the courtesy of an excuse as to why they did not keep their appointment commitment. Bad business practice. I'm glad I see now that they wouldn't show up instead of after I paid them for the fencing job! John Groff 2 reviews • 2 photos Milo Harris 8 reviews • 1 photo Mari Worley Local Guide • 111 reviews • 11 photos Priced a little high but workmanship is great Robin Hamilton Local Guide • 37 reviews • 56 photos"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-09-24",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-09-14",
    "content": "What is a"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2020-09-14",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-08-20",
    "content": "Good"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2020-08-04",
    "content": "I read reviews regarding this company good and not good but I like to try things out for myself I am so glad I did . My husband and I are very please. From with Todd W. To the foreman Pete and the crew. Our fence looks good and we were so excited. We did not have any issues. I have always wanted this company to install my new fence. Positive Responsiveness, Punctuality, Quality, Professionalism, Value"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-06-25",
    "content": "I was told that my fence would be installed on 6-18-2020 after waiting 3 weeks before that. The day had come for an install only to find out the measurements were wrong and the gate wouldn’t fit. I was fine with them coming back the following week to finish but not going to happen. The install gentlemen had talked to Michele on the phone while I was standing there and was informed that she would call me to reschedule later on that day. Thursday came, Friday came, and Saturday and Sunday came and gone with no phone call. It wasn’t until Monday 6-22-2020 that I MADE the phone call to Michele to only find out that the rest of my fence will now not be installed until July 1st!! Extremely unsatisfied and will not be recommending this company to anybody else. Keep in mind, this is a brand new community!! Poor Customer service and their integrity has a lot to be desired. Will also be contacting the BBB. Negative Responsiveness, Punctuality"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-06-22",
    "content": ""
  },
  {
    "name": "May 26, 2020",
    "rating": 1,
    "date": "2020-05-12",
    "content": "Haley Flack 1 review • 0 photos View full review Richard Bond Local Guide • 423 reviews • 11 photos ☆☆☆☆☆☆☆☆☆☆. This is my official first time ever 10 review. I'm really honest when I review be it good or bad I just call it as it is. Right from the first phone call through Danielle's salesman Kevin to the installation team headed up by Mark. I almost never get this level of service from anyone. Everything was done as agreed on for the price we agreed to. The crew was EXTREMELY competen . their attention to detail was top rate. Do yourself a favor and strongly consider this company, you will be glad you did. Thank you so much for your top notch service. Positive Responsiveness, Punctuality, Quality, Professionalism, Value"
  },
  {
    "name": "May 26, 2020",
    "rating": 5,
    "date": "2020-04-09",
    "content": "Absolutely horrible experience with this company. They installed a fence on the back line of my property for an adjacent corporate building contract and broke irrigation lines on my property. I saw their installers walking the line and checking over the job when finished and (they were on other side of fence so I only saw hands and feet) saw one of them pushing dirt up into a hole under the fence. Didn't think anything of it at the time until I realized my irrigation had run the previous night. I went to check area and found the dirt they were pushing was to cover up the hole my irrigation washed out and the sprinkler head was thrown into my yard apparently for me to deal with. I contacted the company and was given the run around, being told that property lines and survey lines would need to be checked and began putting the blame on the builder. What? Don't they do this prior to installing a fence? Anyway, property lines were not the issue. It was that they broke it, they knew it, and tried to cover it up and leave someone else to fix. If this is the way they operate when they think no one is watching, it's not a company I'd ever do business with. Guess big corporate accounts are more important that the little guy and doing what's right. Negative Quality, Professionalism Christopher Colon 5 reviews • 3 photos Eric Tarantino 6 reviews • 1 photo I can't say enough good things about Danielle fence and their staff. From the first person we spoke to, Tom who came out and gave us our quote and planned the project, to Mark and his crew who tore out our old fence and built our new one, everyone was extremely professional. Thanks to everyone involved, oh and btw my new fence looks great. Positive Responsiveness, Punctuality, Quality, Professionalism, Value"
  },
  {
    "name": "May 26, 2020",
    "rating": 5,
    "date": "2020-01-16",
    "content": "DO NOT TRUST THESE GUYS TO INSTALL YOUR FENCE AS PROMISED. THEY WILL LEAVE 14 INCHES OFF YOUR PROPERTY LINE AND MASSIVE GAPS AT TREES. Negative Professionalism Kenneth Kolowajtis II 4 reviews • 1 photo Awesome place for any fence or outdoor amenities!"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2020-02-17",
    "content": "One rating as they never returned my call. Found other fencing company for my fencing needs."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": "Danielle Fence is an outstanding company. I live over an hour away from the showroom. Never made it there to actually see product. Sent Richard an email in what I was looking to have done. He responded back with a quote by just the survey. With a \"ballpark \" price. I went ahead and set up an appointment to have Thom come out and get the exact footage roughly a 1,000 feet of mixed Aluminum and 6' solid vinyl fence. Richards quote and Thoms actual measurements were within dollars of each other. The quotes that I received from different companies comparing \"apples to apples \" were close price wise. The only difference was that Danielle Fence has all of the vinyl fence made in AMERICA!! NOT SHIPPED IN FROM OVERSEAS. With spending well over 10K for this job I wanted it to last. This isn't my 1st vinyl fence that I've had installed but I can tell you the structural quality of this was superior to my previous vinyl fence from a local company. The complete install crew probably had an average of 15 + year's working for Daniel's. That alone says a lot about the company's values in a whole. Job Well done. Thank you. Steve H. New Port Richey FL"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": "People are very helpful"
  },
  {
    "name": "Feb 17, 2020",
    "rating": 5,
    "date": "2019-10-10",
    "content": "Well we have a new vinyl fence. The fence looks fine but the day of process was a mess. First they cut my internet line within 20 minutes of arrival. When they cut the line, they didn’t seem to care. When they hit my neighbors gas line, creating an emergency situation, they were equally unapologetic. This gas line encroachment was noted on the survey I provided them. When the emergency TECO man arrived and asked where the leak was the man showed him and TECO asked for assistance digging to get to the line quickly. The worker told him no, he was on his lunch break, and it wasn’t his fault. So, the TECO man dug it alone. When I told him to help anyways, he walked away. Suffice it to say, the execution was substandard. Kristen Local Guide • 30 reviews • 0 photos I had 196' of vinyl fence installed by Danielle Fence and I am very pleased with my experience. The sales representative, Thom, was very thorough and set clear expectations for the fence layout as we walked the property line. After signing the contract, someone promptly called me to schedule the install, and then called the day before to confirm. The install crew arrived on time and worked diligently to install the fence in one day. They paid attention to detail and were courteous to me as well as my neighbors. I would definitely recommend Danielle Fence to anyone in need of a fence, and I hope to use Danielle in the future for more outdoor projects."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-11-07",
    "content": "Reliable, professional, and friendly!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-11-07",
    "content": ""
  },
  {
    "name": "Feb 17, 2020",
    "rating": 5,
    "date": "2019-08-11",
    "content": "Just called Danielle Fence, Their original service installing the fence was very professional and a Great experience. However, years later when you call to use the warranty for the rotted post they tell you that you can pick-up new post and installed them yourself or Pay $520.00 to 550.00 for labor to install anywhere from three to maybe four post. So much for the warranty. If you can install them yourself why did we call them in the first place. So much for the warranty. Where is the service after sell. I will never use this company again. No customer service after sell. Michael Waskiewicz Local Guide • 16 reviews • 0 photos"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": "Professional from estimate to installation. Excellent communication. They handled all the permits with no issues and we are in a historic district. So happy that we choose Danielle Fence! It looks fantastic - thank you!"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-11-07",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": "Beautiful"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2020-02-17",
    "content": ""
  },
  {
    "name": "Feb 17, 2020",
    "rating": 1,
    "date": "2019-06-28",
    "content": "Antonio Arellano 1 review • 0 photos Haniel Morales 3 reviews • 1 photo Bethany Whitmer Local Guide • 19 reviews • 11 photos Great customer service from the first phone call. Professional, courteous and through from to finish. Work was done quickly, everything was explained in full detail and the fence looked beautiful when finished. Berto Daugherty Local Guide • 0 reviews • 53 photos theresa pinson 27 reviews • 53 photos Kim Norton 3 reviews • 0 photos Marisela Sandoval 17 reviews • 1 photo I love danielle fence Hannah Glogower 3 reviews • 0 photos Patrick Krezel 4 reviews • 0 photos Danielle fence was one of the most professional companies I've ever had work at my home. Michael and his crew were outstanding. The fence is beautiful. the gates work like a charm. We are very pleased."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-05-14",
    "content": "Danielle did an amazing job not only was the price right they came out super quick since we don’t have HOA bs hands down had it done in 4 hours looks amazing."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-04-19",
    "content": "My husband had contracted another company who was not consistent with pricing, terms or down payment-and delayed... View full review"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-02-13",
    "content": "On time, affordable, great quality."
  },
  {
    "name": "Mar 12, 2019",
    "rating": 1,
    "date": "2018-12-04",
    "content": "They hung up the phone twice on me because I would not accept their over the phone quote. I guess coming out and providing information about types of fence and why I should choose them is too hard.... Thank God for other companies. Todd Rossow 1 review • 0 photos Excellent work done, exceeding expectation. Very happy."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-02-13",
    "content": ""
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2019-03-12",
    "content": "Awesome experience from to finish. On install date The job Forman Eugene walked me through every step of the way until I was satisfied. Great customer service"
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-02-13",
    "content": "Quality products and excellent workmanship. Very dependable on delivery and installation."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-03-12",
    "content": "Excellent customer service, job well done. Pricey but worth it. We installed an aluminum fence and looks very nice."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-03-12",
    "content": "The technicians were professional and installed the fence in a day. This is my second fence installation from Danielle."
  },
  {
    "name": "Mar 12, 2019",
    "rating": 5,
    "date": "2018-04-27",
    "content": "Called to get a quote on a very simple chain link fence job, which required 110 ft. of chain link and one gate. Basically two sides of fence to connect to our neighbors fence, small job. Got TWO other quotes from reputable Lakeland fence companies and they were only $150 apart! Danielle Fence was a WHOPPING $1,100 MORE than my highest quote. That's outrageous!!! Their quote was SIXTY-FIVE (65) PERCENT more than my highest quote. That's just plain wrong folks. Do your due diligence and SHOP AROUND! Kathy Poole 9 reviews • 0 photos I couldn’t ask for better work from the installers of my fence. They were very professional and did an excellent job of installation. I wholeheartedly recommend this company. And the fence is beautiful."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-03-12",
    "content": "Very professional and easy to work with. Love my new fence."
  },
  {
    "name": "Mar 12, 2019",
    "rating": 5,
    "date": "2018-01-08",
    "content": "Our home has an aluminum fence around the backyard that was installed by another company prior to our purchasing the home. There was only one access gate and we wanted to add a second one. Original fence company stated they \"don't do repairs\" and gave me the number of a local guy that they farm this type of work out to. He did not return my calls. Found someone else to do it but said I would have to get fence materials myself. Called Alumiguard up in Brooksville as they are the the manufacturer and was told they do not sell to public. However, the Alumi-guard person was extremely helpful and suggested I contact Danielle Fence. The lady I spoke to scheduled an estimate for the work we were wanting. Gentleman who came was on time, very professional, and provided a detailed estimate. We committed on the spot and actually added TWO additional gates. It took about a month for materials to arrive. (first were damaged so had to be re-ordered) Scheduled installation and again, the people were on time, professional, and did a great job. I'm thrilled with my new gates and would highly recommend this company. Suzanne Herrin 1 review • 0 photos Excellence - from initial visit to installation. Extremely pleased. Gene Stonewall 5 reviews • 0 photos Well done professional installation. Joe Askew 1 review • 0 photos Outstanding service. Excellent communication throughout the project. Superior team of installers. Zef was great. Marie Larussa 2 reviews • 1 photo I was told one price to upgrade to PVC by the salesman and a higher price by the office staff. The men that installed the fence were promp, efficient, and courteous. Jo Jossim 0 reviews • 0 photos Sarah Dale 6 reviews • 0 photos We are so pleased with our new fence and the entire process. Our salesman was wonderful and very helpful. The ladies who scheduled the installation were very friendly. The crew that installed our fence were the best. They were so polite and helpful. They did a great job and our fence looks wonderful! Pam & Larry Wilson 6 reviews • 0 photos Excellent workmanship and communication Mollie Rowell Local Guide • 16 reviews • 0 photos Great service. Competitively priced. Friendly staff. cheryl toomer 4 reviews • 0 photos B Bogart 30 reviews • 0 photos Horribly rude man that took my call today about handling funds for another job. If you don't like your job leave don't throw your bad attitude at your customers... Summer Christiansen 12 reviews • 0 photos Needed fencing for about 95 feet and two gates and it was going to cost me $3300. This is an outrageous price for such a small job. However, that is what they told me -for smaller jobs they charge more. Ridiculous, they will not get my business. Joshua Dent 5 reviews • 1 photo Absolutely love my new fence and the quality. The team that installed it were very friendly and consulted me at every step to insure everything was exactly how I wanted it. I would highly recommend to anyone thinking of having a fence installed to give Danielle Fence a call! Dawn Chapman Local Guide • 357 reviews • 696 photos Beautiful work! They installed our complex's entire fence in one day. They consulted if there was even a slight question. A superb, professional job from beginning to end. All the residents I have talked to love it! Robin Iwaniec 1 review • 0 photos The foreman and crew were very professional, courteous and answered all our questions. The work was excellent and we were very happy with the outcome."
  },
  {
    "name": "Unknown",
    "rating": 5,
    "date": "2019-02-13",
    "content": "Awesome company. High quality work. Professional employees."
  },
  {
    "name": "Feb 13, 2019",
    "rating": 5,
    "date": "2016-07-05",
    "content": "Mario Cooper 13 reviews • 1 photo Around March 2013 my wife and I decided to get a fence to keep our two young girls safe and to keep our yard private. We had Danielle Fence give us an estimate, and we had one main concern--that with the weather in FL we may suffer wind damage. Our salesperson Vince D told us that not only did our fence from Danielle have built-in protections, if wind did somehow tear our fence apart all we needed to do is gather our pieces and they would put the fence back together at no charge. That put us over the top--we were sold! Fast forward a year and a few months, a small summer storm or two has now forced one of our post footings above ground level causing our fence to bow outward which makes it even more vulnerable to wind damage. I reached out to Danielle and was told that what I was told was incorrect and that there was nothing they could do. I was told multiple times it would be escalated to a supervisor, but nothing ever came from that. In summary, we absolutely love our fence--the unbowed out part, but I wouldn't trust anything their salespeople tell you. Honestly, if they don't have enough integrity to stand behind their work and correct the wrongs of their greedy salesmen they don't deserve your business. If your people mess up, fix it. Don't run from it. We used to recommend Danielle Fence, but that probably will never happen again unless they make this right. Update: Shortly after posting a few negative online reviews, Danielle Fence came through and promptly fixed the problem we had. They cannot control what their sales employees improperly promise, but they did the right thing in making it right for us. They restored our faith in their company. Paula Cardinali Local Guide • 17 reviews • 2 photos Great company. They are friendly, fast, and very neat! I've had them out twice to my home now. Im installing my fence in sections. These guys do a great job every time! Two different crews and both did quality jobs!"
  },
  {
    "name": "Unknown",
    "rating": 1,
    "date": "2019-02-13",
    "content": "Came to the office in October 2014 and met with Jennifer. She was very helpful and listened to all our ideas and asked me to send some pictures for our project to get a quote. I sent the pictures and confirmed receipt. She never got back to us, never gave a quote. In January we followed up (no word at all from Danielle Fence) and the response was family emergency prevented her from providing any follow up for us. She working again, and after several conversation and alterations of plans she agreed to send a quote again. It is now March and I am still waiting. I wouldn't recommend Danielle Fence because if their service is any indication of the work the do, it will not be acceptable."
  }
]